# Housing Market
Introduction:

# Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

In [ ]:
Step 2. Create 3 differents Series, each of length 100, as follows:
The first a random number from 1 to 4
The second a random number from 1 to 3
The third a random number from 10,000 to 30,000

In [2]:
s1=np.random.randint(1,4,size=100)

In [8]:
s11=pd.Series(s1)

In [4]:
s2=np.random.randint(1,3,size=100)

In [9]:
s22=pd.Series(s2)

In [13]:
s3=np.random.randint(10000,30000,size=100)

In [14]:
s33=pd.Series(s3)

# Step 3. Let's create a DataFrame by joinning the Series by column

In [16]:
house_market=pd.concat([s11,s22,s33],axis=1)

In [17]:
house_market

    0  1      2
0   2  2  29262
1   1  1  11695
2   1  2  11778
3   2  2  23030
4   2  2  14547
.. .. ..    ...
95  2  1  29943
96  2  1  18125
97  3  2  19278
98  3  1  13895
99  3  2  22689

[100 rows x 3 columns]

# Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [20]:
house_market.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
house_market

    bedrs  bathrs  price_sqr_meter
0       2       2            29262
1       1       1            11695
2       1       2            11778
3       2       2            23030
4       2       2            14547
..    ...     ...              ...
95      2       1            29943
96      2       1            18125
97      3       2            19278
98      3       1            13895
99      3       2            22689

[100 rows x 3 columns]

# Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [27]:
big_column=pd.concat([s11,s22,s33],axis=0)
print(type(big_column))
big_column=big_column.to_frame()
print(big_column)

<class 'pandas.core.series.Series'>
        0
0       2
1       1
2       1
3       2
4       2
..    ...
95  29943
96  18125
97  19278
98  13895
99  22689

[300 rows x 1 columns]

# Step 6. Oops, it seems it is going only until index 99. Is it true?

In [29]:

# no the index are kept but the length of the DataFrame is 300
len(big_column)

300

# Step 7. Reindex the DataFrame so it goes from 0 to 299

In [30]:
big_column.reset_index(drop=True, inplace=True)
big_column

         0
0        2
1        1
2        1
3        2
4        2
..     ...
295  29943
296  18125
297  19278
298  13895
299  22689

[300 rows x 1 columns]